package voithitika;

import java.io.BufferedReader;
import java.io.File;
import java.io.FileInputStream;
import java.io.IOException;
import java.io.InputStreamReader;
import java.sql.Connection;
import java.sql.DriverManager;
import java.sql.PreparedStatement;
import java.sql.SQLException;
import java.sql.Statement;
import java.util.Arrays;


public class PerioxesToArray {
	public static final String[] perioxes = {"﻿Άγιος Ανδρέας Γαβαλού", "Άγιος Βλάσιος", "Άγιος Κωνσταντίνος", "Αγρίνιο", "Αιτωλικό", "Άκτιο", "Αμφιλοχία", "Αντίρριο", "Άνω Χώρα", "Αστακός", "Βόνιτσα", "Γαβαλού", "Γραμμένη Οξυά", "Δοκίμιο", "Εμπεσός", "Ευηνοχώρι", "Θέρμο", "Καινούργιο", "Κατούνα", "Κατοχή", "Κλεπά", "Ματαράγκα", "Μεγάλη Χώρα", "Μενίδι", "Μεσολόγγι", "Μύτικας", "Ναύπακτος", "Νέα Αβόρανη", "Νεοχώρι Αιτωλοακαρνανίας", "Πάλαιρος", "Παναιτώλιο", "Παραβόλα", "Πλάτανος Ναυπάκτου", "Σίμος", "Στράτος", "Τερψιθέα", "Φυτείες", "Χρυσοπηγή","﻿Αγία Τριάδα Αργολίδας", "Αλέα", "Άργος", "Αχλαδόκαμπος", "Δρέπανο Αργολίδας", "Ερμιόνη", "Κουτσοπόδι", "Κρανίδι", "Λυγουριό", "Ναύπλιο", "Νέα Επίδαυρος", "Νέα Κίος", "Παλαιά Επίδαυρος", "Τολό"                        ,"﻿Άγιος Ανδρέας", "Άγιος Νικόλαος Αρκαδίας", "Άγιος Πέτρος", "Άστρος", "Βαλτεσινίκο", "Βυτίνα", "Δημητσάνα", "Ελαιοχώρι", "Κανδήλα", "Καρίταινα", "Καστρί", "Κάτω Ασέα", "Κοντοβάζαινα", "Κοσμάς", "Κοτύλιο", "Λαγκάδια", "Λεβίδι", "Λεοντάρι Αρκαδίας", "Λεωνίδι", "Μεγαλόπολη", "Νεστάνη", "Παλούμπα", "Παράλιο Άστρος", "Πουρναριά", "Στάδιο", "Τρίπολη", "Τρόπαια", "Τυρός"          ,"﻿Άγναντα", "Αμμότοπος", "Άνω Καλεντίνη", "Άρτα", "Βουργαρέλι", "Δημάρι", "Κομπότι", "Μελισσουργοί", "Μηλιανά", "Νεοχώρι Άρτας", "Πέτα", "Ροδαυγή", "Φιλοθέη Άρτας", "Χαλκιάδες"                        ,"﻿Αγία Βαρβάρα", "Αγία Κυριακή", "Αγία Μαρίνα Αίγινας", "Αγία Μαρίνα Γραμματικού", "Αγία Μαρίνα Κορωπίου", "Αγία Μαρίνα Νέας Μάκρης", "Αγία Παρασκευή", "Άγιοι Ανάργυροι", "Άγιοι Απόστολοι", "Άγιος Δημήτριος", "Άγιος Ιωάννης Ρέντης", "Άγιος Νικόλαος Αναβύσσου", "Άγιος Νικόλαος Λούτσας", "Άγιος Παντελεήμονας", "Άγιος Σεραφείμ", "Άγιος Στέφανος", "Αθήνα", "Αιάντειο", "Αιγάλεω", "Αίγινα", "Αλεποχώρι", "Άλιμος", "Αμπελάκια", "Ανάβυσσος", "Ανθούσα", "Άνοιξη", "Άνω Λιόσια", "Άνω Νέα Παλάτια", "Αργυρούπολη", "Αρτέμιδα", "Ασπρόπυργος", "Αυλάκι", "Αυλώνα", "Αφίδνες", "Αχαρνές", "Βάρη", "Βαρνάβας", "Βίλια", "Βούλα", "Βουλιαγμένη", "Βραυρώνα", "Βριλήσσια", "Βύρωνας", "Γαλάζια Ακτή", "Γαλατάς Αττικής", "Γαλάτσι", "Γέρακας", "Γλυκά Νερά", "Γλυφάδα", "Γραμματικό", "Δασκαλειό", "Δάφνη", "Διόνυσος", "Δραπετσώνα", "Δροσιά", "Εκάλη", "Ελευσίνα", "Ελληνικό", "Ερυθρές", "Ζεφύρι", "Ζούμπερι", "Ζωγράφος", "Ηλιούπολη", "Θρακομακεδόνες", "Θυμάρι", "Ίλιον", "Καισαριανή", "Κάλαμος Αττικής", "Καλέτζι", "Καλλιθέα", "Καλλιτεχνούπολη", "Καλύβια Θορικού", "Καματερό", "Κάντζα", "Καπανδρίτι", "Κάτω Σούλι", "Κερατέα", "Κερατσίνι", "Κηφισιά", "Κινέτα", "Κόκκινο Λιμανάκι", "Κορυδαλλός", "Κορωπί", "Κουβαράς", "Κρυονέρι", "Κύθηρα", "Κυψέλη Αίγινας", "Λαγονήσι", "Λάκκα", "Λαύριο", "Λουτρόπυργος", "Λυκόβρυση", "Μαγούλα", "Μάνδρα", "Μαραθώνας", "Μαρκόπουλο", "Μαρούσι", "Μάτι", "Μέγαρα", "Μέθανα", "Μελίσσια", "Μεσαγρός", "Μεταμόρφωση", "Μοσχάτο", "Νέα Ερυθραία", "Νέα Ιωνία", "Νέα Μάκρη", "Νέα Παλάτια", "Νέα Πεντέλη", "Νέα Πέραμος Αττικής", "Νέα Πολιτεία", "Νέα Σμύρνη", "Νέα Φιλαδέλφεια", "Νέα Χαλκηδόνα", "Νέο Ηράκλειο", "Νέο Ψυχικό", "Νέος Βουτζάς", "Νίκαια", "Ντράφι", "Παιανία", "Παλαιά Φώκαια", "Παλαιό Φάληρο", "Παλλήνη", "Παλούκια", "Παπάγος", "Πειραιάς", "Πεντέλη", "Πέραμα", "Πέρδικα", "Περιστέρι", "Πετρούπολη", "Πεύκη", "Πικέρμι", "Πολυδένδρι", "Πόρος Τροιζηνίας", "Πόρτο Ράφτη", "Ποταμός Κυθήρων", "Ραφήνα", "Ροδόπολη Αττικής", "Σαλαμίνα", "Σαρωνίδα", "Σελήνια", "Σκάλα Ωρωπού", "Σουβάλα", "Σπάτα", "Σπέτσες", "Σταμάτα", "Συκάμινο", "Ταύρος", "Ύδρα", "Υμηττός", "Φιλοθέη", "Φυλή", "Χαϊδάρι", "Χαλάνδρι", "Χαλκούτσι", "Χαμολιά", "Χολαργός", "Ψυχικό", "Ωρωπός", "﻿Άβυθος", "Αγία Παρασκευή Αχαΐας", "Άγιος Βασίλειος", "Αιγείρα", "Αίγιο", "Ακράτα", "Ακταίο", "Άραξος", "Αραχωβίτικα", "Αροανία", "Βιομηχανική Περιοχή Πάτρας", "Βραχνέικα", "Δάφνη Αχαΐας", "Δεμένικα Σαραβάλιου", "Διακοπτό", "Δρέπανο Αχαΐας", "Ερυμάνθεια", "Καλάβρυτα", "Καμάρες", "Καμίνια", "Κάτω Αχαία", "Κάτω Καστρίτσι", "Κάτω Οβρυά", "Κλειτορία", "Κουλουράς", "Κράθιο", "Κρήνη Πάτρας", "Λάππα", "Μιντιλόγλι", "Μυρτιά", "Νέο Σούλι", "Οβρυά", "Παραλία Πατρών", "Πάτρα", "Πλάτανος Αχαΐας", "Προφήτης Ηλίας", "Ρίο", "Ροδοδάφνη", "Σαγαίικα", "Σαραβάλι", "Συχαινά", "Τέμενη", "Τερψιθέα Αχαΐας", "Χαλανδρίτσα", "Ψαθόπυργος",                                                                                                                   "﻿Άγιος Γεώργιος Βοιωτίας", "Αλίαρτος", "Αντίκυρα", "Αράχωβα", "Βάγια", "Δαύλεια", "Δήλεσι", "Δίστομο", "Δόμβραινα", "Θήβα", "Κυριάκι", "Λιβαδειά", "Οινόη Βοιωτίας", "Οινόφυτα", "Ορχομενός", "Παραλία Διστόμου", "Παρόριο", "Σχηματάρι", "Τανάγρα"                   ,"﻿Άγιος Γεώργιος", "Γρεβενά", "Δεσκάτη", "Πολυνέρι", "Σκούμτσια"                                 ,"﻿Άγιος Αθανάσιος Δράμας", "Αμπελάκια Δράμας", "Αργυρούπολη Δράμας", "Δοξάτο", "Δράμα", "Καλαμπάκι", "Κάτω Νευροκόπι", "Κύρια", "Μαυρόβατος", "Νέα Αμισός", "Νέα Σεβάστεια", "Νικηφόρος", "Παρανέστι", "Περίχωρα", "Προσοτσάνη", "Σιταγροί", "Φτελιά", "Φωτολίβος", "Χωριστή"                   ,"﻿Αγαθονήσι", "Ανάληψη Αστυπάλαιας", "Αντιμάχεια", "Αρχάγγελος", "Αστυπάλαια", "Αφάντου", "Γεννάδι", "Έμπωνας", "Ιαλυσός", "Καλυθιές", "Κάλυμνος", "Κάρπαθος", "Κάσος", "Κέφαλος Κω", "Κολύμπια", "Κοσκινού", "Κρεμαστή", "Κως", "Λειψοί", "Λέρος", "Λίνδος", "Μαριτσά", "Μεγίστη", "Νίσυρος", "Παλαιά Πόλη", "Παραδείσι", "Παστίδα", "Πάτμος", "Ρόδος", "Σγουρού", "Σορωνή", "Σύμη", "Τήλος", "Φαληράκι", "Χάλκη", "Ψαλίδι"  ,"﻿Αγία Άννα", "Άγιος Νικόλαος Εύβοιας", "Αλιβέρι", "Αμάρυνθος", "Ανθηδώνα", "Αυλωνάρι", "Βαθύ Αυλίδας", "Βασιλικό", "Δροσιά Ευβοίας", "Δύο Δένδρα", "Έξω Παναγίτσα", "Ερέτρια", "Ιστιαία", "Καθενοί", "Κάρυστος", "Κονίστρες", "Κριεζά", "Κύμη", "Λίμνη", "Λουτρά Αιδηψού", "Μαντούδι", "Μαρμάρι", "Μπούρτζι", "Νέα Αρτάκη", "Νέα Λάμψακος", "Οξύλιθος", "Παραλία Αυλίδας", "Πολιτικά", "Σκύρος", "Στενή Δίρφυος", "Στύρα", "Υλίκη", "Φάρος", "Χαλκίδα", "Ψαχνά", "Ωρεοί"  ,"﻿Αλεξανδρούπολη", "Απαλός", "Γέφυρα Κήπων", "Διδυμότειχο", "Δίκαια", "Καστανιές", "Κυπρίνος", "Λάβαρα", "Μαΐστρος", "Μεταξάδες", "Νέα Βύσσα", "Νέα Χιλή", "Ορεστιάδα", "Πέπλος", "Ρίζια", "Σαμοθράκη", "Σουφλί", "Συκορράχη", "Τυχερό", "Φέρες"                  ,"﻿Άγραφα", "Γρανίτσα", "Καρπενήσι", "Κερασοχώρι", "Κρίκελλο", "Μαυρόλογγος", "Προυσός", "Ραπτόπουλο", "Φουρνά"                             ,"﻿Βολίμες", "Γαϊτάνι", "Ζάκυνθος", "Καταστάρι", "Μαχαιράδο", "Τσιλιβί"                                ,"﻿Αμαλιάδα", "Ανδραβίδα", "Ανδρίτσαινα", "Αρχαία Ολυμπία", "Βάρδα", "Βαρθολομιό", "Γαστούνη", "Επιτάλιο", "Εφύρα", "Ζαχάρω", "Καβάσιλας", "Καλλιθέα Ηλείας", "Καράτουλας", "Κατάκολο", "Κρέστενα", "Κυλλήνη", "Λάλας", "Λάμπεια", "Λεχαινά", "Μυρσίνη", "Νέα Φιγαλεία", "Πύργος Ηλείας", "Τραγανό", "Χάβαρι"              ,"﻿Αγγελοχώρι Ημαθίας", "Άγιος Γεώργιος Ημαθίας", "Αλεξάνδρεια", "Βεργίνα", "Βέροια", "Ειρηνούπολη", "Κοπανός", "Λαζοχώρι", "Μακροχώρι Ημαθίας", "Μελίκη", "Νάουσα", "Πατρίδα", "Πλατύ", "Σταυρός Ημαθίας"                        ,"﻿Αγία Βαρβάρα Ηρακλείου", "Άγιοι Δέκα", "Άγιος Μύρωνας", "Αηδονοχώρι", "Άνω Βιάννος", "Αρκαλοχώρι", "Αρχάνες", "Ασήμι", "Βασιλείες", "Γάζι", "Γούρνες Πεδιάδος", "Δάφνες", "Έμπαρος", "Επισκοπή Ηρακλείου", "Ζαρός", "Ηράκλειο", "Καρτερός Ελαίας", "Καστέλλι", "Κάτω Γούβες", "Κνωσσός", "Κουτουλουφάρι", "Κρουσώνας", "Λιμένας Χερσονήσου", "Μαλάδες", "Μάλια", "Μοίρες", "Μοχός", "Νέα Αλικαρνασσός", "Νέο Στάδιο", "Πόρος Ηρακλείου", "Πύργος Μονοφατσίου", "Σταλίδα", "Τυμπάκι", "Φοινικιά"    ,"﻿Γλυκή", "Γραικοχώρι", "Ηγουμενίτσα", "Λεπτοκαρυά Θεσπρωτίας", "Μαργαρίτι", "Μόρφιο", "Νέα Σελεύκεια", "Παραμυθιά", "Φιλιάτες"                             ,"﻿Αγγελοχώρι", "Αγία Τριάδα", "Άγιος Αθανάσιος", "Άγιος Παύλος", "Αγχίαλος", "Άδενδρο", "Αμπελόκηποι", "Ανατολικό", "Άνω Περαία", "Ασβεστοχώρι", "Ασκός", "Ασπροβάλτα", "Άσσηρος", "Βαθύλακκος", "Βασιλικά", "Βιομηχανική Περιοχή Θεσσαλονίκης", "Γαλήνη Θεσσαλονίκης", "Γέφυρα Θεσσαλονίκης", "Διαβατά", "Δρυμός", "Ελευθέριο", "Εξοχή", "Επανομή", "Ευκαρπία", "Εύοσμος", "Ζαγκλιβέρι", "Θέρμη", "Θεσσαλονίκη", "Ιωνία Θεσσαλονίκης", "Καλαμαριά", "Καλοχώρι", "Καρδιά", "Κάτω Σχολάρι", "Κουφάλια", "Κύμινα", "Λαγκαδάς", "Λαγκαδίκια", "Λητή", "Μελισσοχώρι", "Μενεμένη", "Νέα Απολλωνία", "Νέα Κερασιά", "Νέα Μαγνησία", "Νέα Μηχανιώνα", "Νέα Ραιδεστός", "Νεάπολη Θεσσαλονίκης", "Νέο Ρύσιο", "Νέοι Επιβάτες", "Νικόπολη", "Ξυλόπολη", "Πανόραμα", "Περαία", "Πεύκα Ρετζίκι", "Πλαγιάρι", "Πολίχνη", "Πυλαία", "Σίνδος", "Σουρωτή", "Σοχός", "Σταυρός", "Σταυρούπολη", "Συκιές", "Ταγαράδες", "Τριάδι Θέρμης", "Τριανδρία", "Τρίλοφος", "Φίλυρο", "Χαλάστρα", "Χαλκηδόνα", "Χορτιάτης", "Ωραιόκαστρο",                                                                                          "﻿Αμπελοχώρι", "Ανατολή", "Ασπράγγελοι", "Βαλανιδιά", "Βροσίνα", "Βρυσούλα", "Γρεβενίτιο", "Δελβινάκι", "Δερβίζιανα", "Δολιανά", "Ελεούσα", "Ζίτσα", "Ιωάννινα", "Καλέντζι", "Καρδαμίτσια", "Κατσικάς", "Κεφαλόβρυσο", "Κόνιτσα", "Κουκλέσι", "Μέτσοβο", "Μπάφρα", "Παλαιοσέλι", "Πεδινή", "Πέραμα Ιωαννίνων", "Περίβλεπτος", "Πράμαντα", "Πυρσόγιαννη", "Σεριζιανά", "Σταυράκι", "Τσεπέλοβο"        ,"﻿Αμυγδαλεώνας", "Ελευθερούπολη", "Ζυγός", "Θάσος", "Θεολόγος", "Καβάλα", "Κεραμωτή", "Κεχρόκαμπος", "Κρηνίδες", "Λιμενάρια", "Μουσθένη", "Νέα Ηρακλείτσα", "Νέα Καρβάλη", "Νέα Πέραμος Καβάλας", "Νικήσιανη", "Παλαιό Τσιφλίκι", "Πρίνος", "Χρυσούπολη"                    ,"﻿Αγναντερό", "Ανθηρό", "Βραγκιανά", "Ιτέα Καρδίτσας", "Καρδίτσα", "Καρδιτσομάγουλα", "Λεοντάρι Καρδίτσας", "Μεσενικόλας", "Μουζάκι", "Παλαμάς", "Προάστιο Καρδίτσας", "Ρεντίνα", "Σοφάδες", "Φανάρι"                        ,"﻿Ακρίτες", "Άργος Ορεστικού", "Βίτσι", "Βογατσικό", "Δισπηλιό", "Επταχώρι", "Καστοριά", "Κλεισούρα", "Κλήμα", "Κορησός", "Μακροχώρι", "Μανιάκοι", "Μαυροχώρι", "Μεσοποταμία", "Νέα Λεύκη", "Νεστόριο", "Χλόη"                     ,"﻿Γάιος", "Γουβιά", "Καρουσάδες", "Καστελλάνοι Μέσης", "Κέρκυρα", "Λευκίμμη", "Ποταμός", "Σκριπερό"                              ,"﻿Αγία Ευφημία", "Αργοστόλι", "Βασιλικιάδες", "Ιθάκη", "Ληξούρι", "Πόρος", "Σάμη", "Σταυρός Ιθάκης", "Φισκάρδο"                             ,"﻿Αξιούπολη", "Γουμένισσα", "Ευρωπός", "Κιλκίς", "Μικρόκαμπος", "Μουριές", "Πολύκαστρο", "Ριζανά", "Συνοριακός Σταθμός Ευζώνων", "Χέρσο"                            ,"﻿Αιανή", "Βελβεντός", "Εμπόριο", "Εράτυρα", "Κοζάνη", "Κρόκος", "Νεάπολη Κοζάνης", "Πεντάβρυσος", "Πεντάλοφος", "Προάστιο Κοζάνης", "Πτολεμαίδα", "Πύργοι", "Σέρβια", "Σιάτιστα", "Σκαλοχώρι", "Τσοτύλι"                      ,"﻿Άγιοι Θεόδωροι", "Αθίκια", "Αρχαία Κόρινθος", "Άσσος", "Βέλο", "Βραχάτι", "Γκούρα", "Δερβένι", "Ζευγολατειό", "Ίσθμια", "Καλιάνοι", "Κάτω Άσσος", "Κάτω Διμηνιό", "Κιάτο", "Κοκκώνι", "Κόρινθος", "Λέχαιο", "Λουτράκι", "Νεμέα", "Νεράντζα", "Ξυλόκαστρο", "Περαχώρα", "Περιγιάλι", "Σούλι", "Σοφικό", "Χιλιομόδι"            ,"﻿Αμοργός", "Ανάφη", "Άνδρος", "Αντίπαρος", "Άνω Σύρος", "Γαύριο", "Εμπορειό", "Ερμούπολη", "Θήρα", "Ίος", "Ιουλίδα", "Κίμωλος", "Κόρθιο", "Κορωνίδα", "Κύθνος", "Μήλος", "Μονόλιθος", "Μύκονος", "Νάξος", "Νάουσα Πάρου", "Οία", "Πάνορμος Τήνου", "Πάρος", "Σέριφος", "Σίκινος", "Σίφνος", "Σύρος", "Τάλαντα", "Τήνος", "Φολέγανδρος", "Χαλκείο"       ,"﻿Αρεόπολη", "Βλαχιώτης", "Γεράκι", "Γερολιμένας", "Γύθειο", "Καρυές Λακωνίας", "Καστόρειο", "Κροκεές", "Μολάοι", "Μονεμβασιά", "Νεάπολη Λακωνίας", "Νιάτα", "Ξηροκάμπι", "Παπαδιάνικα", "Σκάλα", "Σπάρτη"                      ,"﻿Αγιά", "Αμπελώνας", "Βερδικούσσα", "Γιάννουλη", "Γόννοι", "Ελασσόνα", "Κρανέα Ελασσόνας", "Λάρισα", "Λιβάδι", "Νίκαια Λάρισας", "Πλατύκαμπος", "Πυργετός", "Σκοπιά Φαρσάλων", "Συκούριο", "Τύρναβος", "Φαλάνη", "Φάρσαλα"                     ,"﻿Άγιος Νικόλαος Λασιθίου", "Άνω Σύμη", "Ελούντα", "Ιεράπετρα", "Κριτσά", "Μάλες", "Νεάπολη Κρήτης", "Σητεία", "Σταυροχώρι", "Τζερμιάδο", "Τουρλωτή", "Φουρνή", "Χανδράς"                         ,"﻿Αγία Παρασκευή Λέσβου", "Αγιάσος", "Άγιος Ευστράτιος", "Άντισσα", "Βαρειά", "Ερεσός", "Καλλιθέα Μύρινας", "Καλλονή", "Μανταμάδος", "Μήθυμνα", "Μούδρος", "Μύρινα", "Μυτιλήνη", "Παππάδος", "Πέραμα Λέσβου", "Πέτρα Λέσβου", "Πλωμάρι", "Πολίχνιτος"                    ,"﻿Βαθύ", "Βασιλική", "Κάλαμος", "Καρυά Λευκάδας", "Λευκάδα", "Νυδρί"                                ,"﻿Αγία Παρασκευή Βόλου", "Άγιος Γεώργιος Ιωλκού", "Αγριά", "Αλμυρός", "Αλόννησος", "Ανάβρα", "Ανακασιά", "Άνω Λεχώνια", "Αργαλαστή", "Αργυρόνησο", "Βελεστίνο", "Βόλος", "Διμήνιο Βόλου", "Ευξεινούπολη", "Ζαγορά", "Καλά Νερά", "Καλλιθέα Μαγνησίας", "Κάτω Λεχώνια", "Κήπια", "Μηλιές", "Μηλίνα", "Νέα Αγχίαλος", "Νέα Ιωνία Βόλου", "Νέες Παγασές", "Πορταριά", "Σκιάθος", "Σκόπελος", "Σούρπη", "Τρίκερι", "Τσαγκαράδα"        ,"﻿Άγιος Νικόλαος Μεσσηνίας", "Ανδρούσα", "Αριστομένης", "Ασπρόχωμα", "Βέργα", "Γαργαλιάνοι", "Διαβολίτσι", "Δώριο", "Θουρία", "Καλαμάτα", "Κάμπος", "Καρδαμύλη", "Κοπανάκι", "Κορώνη", "Κυπαρισσία", "Λογγά", "Μεθώνη Μεσσηνίας", "Μελιγαλάς", "Μεσσήνη", "Παραλία Καλαμάτας", "Πεταλίδι", "Πέτρα", "Πύλος", "Φαρές", "Φιλιατρά", "Χατζής", "Χώρα Τριφυλίας", "Ψάρι"          ,"﻿Άβδηρα", "Γενισέα", "Εύλαλο", "Εχίνος", "Μυρτούσσα", "Ξάνθη", "Πασχαλιά", "Πόρτο Λάγος", "Σταυρούπολη Ξάνθης", "Χρύσα"                            ,"﻿Αγροσυκιά", "Άθυρα", "Αριδαία", "Άρνισσα", "Γιαννιτσά", "Έδεσσα", "Εξαπλάτανος", "Καρυώτισσα", "Κρύα Βρύση", "Πέλλα", "Σκύδρα"                           ,"﻿Άγιος Δημήτριος Πιερίας", "Αιγίνιο", "Αλώνια", "Ανδρομάχη", "Αρωνάς", "Βριά", "Βροντού", "Γανοχώρα", "Ελατοχώρι", "Καλλιθέα Πιερίας", "Καρίτσα", "Κατερίνη", "Κατερινόσκαλα", "Κάτω Μηλιά", "Κίτρος", "Κολινδρός", "Κονταριώτισσα", "Κορινός", "Κούκκος", "Λαγορράχη", "Λεπτοκαρυά", "Λιτόχωρο", "Μακρύγιαλος", "Μεθώνη", "Νέα Έφεσος", "Νέα Τραπεζούντα", "Νέοι Πόροι", "Νεοκαισάρεια", "Νέος Παντελεήμονας", "Ολυμπιακή Ακτή", "Παλαιό Κεραμίδι", "Παραλία Κατερίνης", "Περίσταση", "Πλαταμώνας", "Ρητίνη", "Σβορώνος", "Σφενδάμι" ,"﻿Θεσπρωτικό", "Καναλλάκι", "Κοντάτες", "Λούρος", "Πάργα", "Πρέβεζα", "Φιλιππιάδα"                               ,"﻿Αγία Γαλήνη", "Αμάρι", "Ανώγεια", "Γαράζο", "Επισκοπή Ρεθύμνου", "Μύρθιος", "Πάνορμος", "Πέραμα Ρεθύμνου", "Πλατανές", "Πρινές Ρεθύμνου", "Ρέθυμνο", "Σπήλι"                          ,"﻿Αίγειρος", "Ίασμος", "Κομοτηνή", "Ξυλαγανή", "Οργάνη", "Σάπες"                                ,"﻿Άγιος Κήρυκος", "Βαθύ Σάμου", "Εύδηλος", "Καλάμι", "Καρλόβασι", "Μαραθόκαμπος", "Μυτιληνιοί", "Πυθαγόρειο", "Πύργος Σάμου", "Ράχες", "Σάμος", "Φούρνοι"                          ,"﻿Αλιστράτη", "Δραβήσκος", "Ηράκλεια", "Κάτω Πορόια", "Κεφαλοχώρι", "Λευκώνας", "Μαυροθάλασσα", "Νέα Ζίχνη", "Νέο Πετρίτσι", "Νέος Σκοπός", "Νιγρίτα", "Πεντάπολη", "Πρώτη Σερρών", "Ροδολίβος", "Ροδόπολη", "Σέρρες", "Σιδηρόκαστρο", "Στρυμονικό", "Τερπνή", "Χρυσό"                  ,"﻿Αγιόφυλλο", "Καλαμπάκα", "Καστανιά", "Κηπάκι", "Λεπτοκαρυά Τρικάλων", "Μεσοχώρα", "Μυρόφυλλο", "Οιχαλία", "Πύλη", "Ριζαρειό", "Τρίκαλα", "Φαρκαδώνα"                          ,"﻿Αγία Παρασκευή Φθιώτιδας", "Άγιος Γεώργιος Φθιώτιδας", "Άγιος Κωνσταντίνος Φθιώτιδας", "Αμφίκλεια", "Αταλάντη", "Δομοκός", "Ελάτεια", "Καμμένα Βούρλα", "Κάτω Τιθορέα", "Λαμία", "Λάρυμνα", "Λιβανάτες", "Μακρακώμη", "Μαλεσίνα", "Μαρτίνο", "Μεγάλη Βρύση", "Μπράλος", "Μώλος", "Πελασγία", "Ροδίτσα", "Σπερχειάδα", "Στυλίδα", "Υπάτη"               ,"﻿Άγιος Γερμανός", "Αμύνταιο", "Αντάρτικο", "Βαρικό", "Βεύη", "Λέχοβο", "Μελίτη", "Ξινό Νερό", "Σκλήθρο", "Φιλώτας", "Φλώρινα"                           ,"﻿Άμφισσα", "Γαλαξίδι", "Γραβιά", "Δελφοί", "Δεσφίνα", "Ερατεινή", "Ευπάλιο", "Ιτέα Φωκίδας", "Κίρρα", "Κροκύλειο", "Λιδορίκι", "Μαυρολιθάρι"                          ,"﻿Άγιος Νικόλαος Χαλκιδικής", "Αρναία", "Βεργιά", "Γαλάτιστα", "Γερακινή", "Δάφνη Αγίου Όρους", "Ιερισσός", "Καρυές", "Κασσάνδρεια", "Κρήμνη", "Μεγάλη Παναγιά", "Νέα Ηράκλεια", "Νέα Καλλικράτεια", "Νέα Μουδανιά", "Νέα Πλάγια", "Νέα Ποτείδαια", "Νέα Τρίγλια", "Νέος Μαρμαράς", "Νικήτη", "Ολυμπιάδα", "Ορμύλια", "Πευκοχώρι", "Πολύγυρος", "Συκιά", "Σωζόπολη", "Φλογητά", "Χανιώτης"           ,"﻿Άγιος Ιωάννης Χανίων", "Αλικιανός", "Βαθή Χανίων", "Βαμβακόπουλο", "Βάμος", "Βουκολιές", "Βρύσες", "Γαλατάς", "Δαράτσος", "Καλύβες", "Κάνδανος", "Κάτω Γαλατάς", "Κάτω Δαράτσος", "Κίσσαμος", "Κόκκινο Μετόχι Χανίων", "Κολυμβάρι", "Κορακιές", "Κουνουπιδιανά", "Μουρνιές", "Νεροκούρος", "Παζινός", "Παλαιοχώρα", "Περιβόλια Κυδωνίας", "Πλατανιάς", "Ροδοβάνι", "Σούδα", "Τσικαλαριά", "Χανιά", "Χώρα Σφακίων"         ,"﻿Βολισσός", "Βροντάδος", "Θυμιανά", "Καλαμωτή", "Καλλιμασιά", "Καρδάμυλα", "Οινούσσες", "Χίος", "Ψαρά"};
	public static final String[] NOMOILOWERCASE = {"Αιτωλοακαρνανίας","Αργολίδας","Αρκαδίας","Άρτας","Αττικής","Αχαΐας","Βοιωτίας","Γρεβενών","Δράμας","Δωδεκανήσου","Εβοίας","Έβρου","Ευρυτανίας","Ζακύνθου","Ηλείας","Ημαθίας","Ηρακλείου","Θεσπρωτίας","Θεσσαλονίκης","Ιωαννίνων","Καβάλας","Καρδίτσας","Καστοριάς","Κέρκυρας","Κεφαλληνίας","Κιλκίς","Κοζάνης","Κορινθίας","Κυκλάδων","Λακωνίας","Λάρισας","Λασιθίου","Λέσβου","Λευκάδας","Μαγνησίας","Μεσσηνίας","Ξάνθης","Πέλλας","Πιερίας","Πρέβεζας","Ρεθύμνου","Ροδόπης","Σάμου","Σερρών","Τρικάλων","Φθιώτιδας","Φλώρινας","Φωκίδας","Χαλκιδικής","Χανίων","Χίου"};
	public static final String rootPass = "jmeZt5BX3MDSh82a";
	public static void main(String[] args){
		
		String[][] finalArray = new String[51][161];
		String[] finalNomoi = new String[51];
		File f = new File("perioxes");
		File[] directoryListing = f.listFiles();
		int i = 0;
		int j = 0;
		
		Connection con;
		Statement st = null;
		
		if(directoryListing !=null){
			
			for (File child : directoryListing){
				try {
					con  = DriverManager.getConnection("jdbc:mysql://localhost:3306/?useUnicode=yes&characterEncoding=UTF-8","root",rootPass);
					finalNomoi[i] = child.getName().replace(".txt", "");
					st = con.createStatement();
					st.executeUpdate("CREATE DATABASE revenge_"+finalNomoi[i]);
					con.close();
				} catch (SQLException e1) {
					// TODO Auto-generated catch block
					e1.printStackTrace();
				}

				System.out.println("***"+finalNomoi[i]+"***");
				try {
					@SuppressWarnings("resource")
					BufferedReader br = new BufferedReader(new InputStreamReader(new FileInputStream(child),"UTF8"));
					try{
						Class.forName("com.mysql.jdbc.Driver");
						con  = DriverManager.getConnection("jdbc:mysql://localhost:3306/revenge_"+finalNomoi[i]+"?useUnicode=yes&characterEncoding=UTF-8","root",rootPass);
						st = con.createStatement();
						st.executeUpdate("CREATE TABLE general (ID int(11) AUTO_INCREMENT primary key, Username varchar(50) COLLATE 'utf8_unicode_ci', Points int(50),Games int(11),Perioxi varchar(50) COLLATE 'utf8_unicode_ci',Fastest int(10),PointsToday int(50))");
					}catch(Exception ex){
						System.out.println("Error: " + ex);
					}
					while((finalArray[i][j]=br.readLine())!=null){
						finalArray[i][j].replace(" ", "_");
						j++;

						String query = "CREATE TABLE "+ finalArray[i][j-1].replace(" ", "_")+" (ID int(11) AUTO_INCREMENT primary key, Username varchar(50) COLLATE 'utf8_unicode_ci',  Points int(50),Games int(11),Fastest int(10),PointsToday int(50))";
						try {
							st.executeUpdate(query);
						} catch (SQLException e) {
							// TODO Auto-generated catch block
							e.printStackTrace();
						}
					}
					
					i++;
					j=0;
					
					
				} catch (IOException e) {
					// TODO Auto-generated catch block
					e.printStackTrace();
				}

			}
			try {
				con  = DriverManager.getConnection("jdbc:mysql://localhost:3306/?useUnicode=yes&characterEncoding=UTF-8","root",rootPass);
				st = con.createStatement();
				st.executeUpdate("CREATE DATABASE revengeGeneral");
				con  = DriverManager.getConnection("jdbc:mysql://localhost:3306/revengeGeneral?useUnicode=yes&characterEncoding=UTF-8","root",rootPass);
				st = con.createStatement();
				st.executeUpdate("CREATE TABLE accounts (ID int(11) AUTO_INCREMENT primary key, Username varchar(50) COLLATE 'utf8_unicode_ci', Password BLOB,Salt BLOB, Points int(50),Games int(11),Perioxi varchar(50) COLLATE 'utf8_unicode_ci',Fastest int(10),Friends text(1000) COLLATE 'utf8_unicode_ci',Avatar int(3),Email varchar(40),LastGame varchar(20),PointsToday int(50),WinsInARow int(3))");
				st.executeUpdate("CREATE TABLE topNomoi(ID int(11) AUTO_INCREMENT primary key,Nomos varchar(50) COLLATE 'utf8_unicode_ci',Points int(50))");
				String query = "INSERT INTO topNomoi(Nomos,Points) VALUES(?,?)";
				PreparedStatement pst = con.prepareStatement(query);
				for(int k =0;k<NOMOILOWERCASE.length;k++){
					pst.setString(1, NOMOILOWERCASE[k]);
					pst.setInt(2, 0);
					pst.executeUpdate();
				}
				st.executeUpdate("CREATE TABLE topPerioxes(ID int(11) AUTO_INCREMENT primary key,Perioxi varchar(50) COLLATE 'utf8_unicode_ci',Points int(50))");
				query = "INSERT INTO topPerioxes(Perioxi,Points) VALUES(?,?)";
				pst = con.prepareStatement(query);
				for(int k =0;k<perioxes.length;k++){
					pst.setString(1, perioxes[k]);
					pst.setInt(2, 0);
					pst.executeUpdate();
				}
			} catch (SQLException e) {
				// TODO Auto-generated catch block
				e.printStackTrace();
			}

	
			
		}

		System.out.println(Arrays.deepToString(finalArray).replace(", ", "\", \"").replace("\"null\",","").replace("[", "{").replace("]", "}").replace("\"null}\", \"", "},").replace(",                                                                                                                           ", "").replace("},{", "},{\""));
	}
}
